app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 25]]
SELECT "drinks".* FROM "drinks" WHERE "drinks"."category_id" = $1  [["category_id", 25]]
---
  def index
    if params[:category_id] == nil
      @drinks = Drink.all
    else
      @drinks = Category.find(params[:category_id]).drinks